# Plant_ReplacePlant

## Description
Replaces a the currently selected plant

```pascal
PROCEDURE Plant_ReplacePlant(plantToReplace : HANDLE);
```

```python
def vs.Plant_ReplacePlant(plantToReplace):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|plantToReplace|HANDLE|   |

## Version
Availability: from Vectorworks 2014

## Category
* PlantObjectCoreTools